{
  "id": "geraldo",
  "name": "Geraldo",
  "image": "geraldoportrait.png",
  "skinChange": {
    "level_1": "geraldoportrait.png",
    "level_3": "geraldoportraitlvl3.png",
    "level_7": "geraldoportraitlvl7.png",
    "level_10": "geraldoportraitlvl10.png",
    "level_20": "geraldoportraitlvl20.png",
    "hero_icon": "heroicongeraldo.png"
  },
  "unlock": "Level 10 and 5000",
  "cost": {
    "easy": "595",
    "medium": "700",
    "hard": "755",
    "impoppable": "840"
  },
  "discountCost": {
    "easy": "545",
    "medium": "640",
    "hard": "690",
    "impoppable": "770"
  },
  "abilities": "Geraldo's Shop (Level 1)",
  "target": "First, Last, Close, Strong",
  "inGameDesc": "Geraldo the shopkeeper sells a selection of useful items and zaps Bloons with his lightning attack.",
  "stats": {
    "damage": [
      "Level 1: 1",
      "Level 7: 2",
      "Level 17: 3",
      "Level 19: 4",
      "Level 20: 9"
    ],
    "pierce": [
      "Level 1: 5",
      "Level 7: 10",
      "Level 11: 20",
      "Level 19: 25"
    ],
    "attackSpeed": [
      "Moderately Slow (every 1.1s)"
    ],
    "range": [
      "40"
    ],
    "statusEffects": [
      "Blowback (Creepy Idol)",
      "Standard Glue (Tube of Amaz-o-Glue)",
      "Burn (Gerry's Fire)",
      "MOAB Stun (Level 12+ Creepy Idol)"
    ],
    "towerBoosts": [
      "Jar of Pickles",
      "See Invisibility Potion",
      "Sharpening Stone",
      "Worn Hero's Cape",
      "Fertilizer",
      "Rejuv Potion",
      "Paragon Power Totem"
    ],
    "incomeBoosts": [
      "Fertilizer",
      "Rejuv Potion"
    ],
    "camo": [
      "Requires items: Stack of Old Nails (Level 1+)",
      "See Invisibility Potion (Level 3+)",
      "Genie Bottle (Level 12+)"
    ],
    "levelSpeed": [
      "Fast (1.0x)"
    ]
  },
  "levels": [
    {
      "image": "herolevel1.png",
      "name": "1",
      "cost": {
        "easy": "595",
        "medium": "700",
        "hard": "755",
        "impoppable": "840"
      },
      "levelBody": "Description: Available Items! Shooty Turret, Stack of Old Nails, Creepy Idol, Jar of Pickles. Geraldo also has a short range magical attack.\nEffect: Geraldo owns a shop containing multiple items in stock at a limited supply, accessed using the ability button. Can restock some items after a certain number of rounds. Geraldo begins with the following items in his store: Shooty Turret, Stack of Old Nails, Creepy Idol, Jar of Pickles.\n\n\nGeraldo also attacks with lightning explosions shot lightning quick every 1.1s within a 10 blast radius, popping up to 5 bloons per shot and dealing 1 damage to them. Geraldo starts with 40 range."
    },
    {
      "image": "herolevel2.png",
      "name": "2",
      "cost": "180",
      "levelBody": "Description: New Item! Rare Quincy Action Figure - increases in value the longer you possess it!\nEffect: Unlocks Rare Quincy Action Figure, an action figure which can be placed on the map. It is a non-attacking sub-tower whose main purpose is to gain monetary value over time. The value (both buy and sell) increases exponentially over rounds. Disabled on CHIMPS."
    },
    {
      "image": "herolevel3.png",
      "name": "3",
      "cost": "460",
      "levelBody": "Description: New Item! See Invisibility Potion - grants short term camo detection to a Monkey Tower or Hero. Geraldo's attack range increases.\nEffect: Unlocks See Invisibility Potion. The Invisibility Potion grants camo detection for 10 rounds.\n\n\nGeraldo's attack range increased from 40 to 45."
    },
    {
      "image": "herolevel4.png",
      "name": "4",
      "cost": "1000",
      "levelBody": "Description: New Item! Tube of Amaz-o-Glue - can be placed on the track to slow Bloons down.\nEffect: Unlocks Tube of Amaz-o-Glue, which can be placed on the track to slow any non-MOAB class Bloon by 50% for 24 seconds. Lasts for up to 100 Bloons or 4 rounds, whichever comes first."
    },
    {
      "image": "herolevel5.png",
      "name": "5",
      "cost": "1860",
      "levelBody": "Description: New Item! Sharpening Stone - boosts the pierce of a Monkey Tower or Hero when doing sharp-type damage. Geraldo attacks faster.\nEffect: Unlocks Sharpening Stone, which grants +1 pierce to target tower whose default damage type is Sharp for 10 rounds.\n\n\nGeraldo's attack cooldown decreases from 1.1s to 1s."
    },
    {
      "image": "herolevel6.png",
      "name": "6",
      "cost": "3280",
      "levelBody": "Description: New Item! Worn Hero's Cape - turns a tier 2 or lower Dart Monkey into a Super Monkey! These converted Super Monkeys can only be upgraded to Tier 3.\nEffect: Unlocks Worn Hero's Cape, which transforms a tier 2 or lower Dart Monkey into a Super Monkey which is capped at tier 3 upgrades. Cannot be used if Super Monkeys are not available."
    },
    {
      "image": "herolevel7.png",
      "name": "7",
      "cost": "5180",
      "levelBody": "Description: New Item! Blade Trap - when a visible Bloon touches the trap, a Blade Maelstrom goes off. Geraldo's main attack increases in damage and pierce.\nEffect: Unlocks Blade Trap. Blade Traps can only be placed on bloon track. When touched by a bloon, the trap immediately produces a maelstrom of blades similarly to Blade Maelstrom. Works just like a raw Maelstrom; dealing 1 damage per blade, not detecting Camo, nor popping Frozen and Lead.\n\n\nGeraldo's damage increased from 1 to 2 and pierce increased from 5 to 10."
    },
    {
      "image": "herolevel8.png",
      "name": "8",
      "cost": "8320",
      "levelBody": "Description: New Item! Bottle of 'Gerry's Fire' - 2.8 million Bloonville units of pure hot sauce fire! Gives a Monkey, Hero, or minion a fiery attack for 10 rounds.\nEffect: Unlocks Bottle of 'Gerry's Fire' Hot Sauce, which gives target tower a small familiar that circles a targeted tower for 10 rounds, and attacks by rapidly breathing fire, similarly to the Wizard Monkey's Dragon's Breath upgrade. Deals 1 damage per flame and adds a burn that damages every 1.5s and lasts for 3.0s."
    },
    {
      "image": "herolevel9.png",
      "name": "9",
      "cost": "9380",
      "levelBody": "Description: New Item! Fertilizer - targeted Banana Farms that produce visible bananas increase production and get a cash bonus over several rounds. Geraldo's main attack blast radius increases.\nEffect: Unlocks Fertilizer, which increases Banana value of one Banana Farm by 25%. Only visible bananas will be affected, thus restricting its use from Banks and Marketplaces. Lasts for 5 rounds. CHIMPS disables Fertilizer. Geraldo's blast radius increases from 10 to 13."
    },
    {
      "image": "herolevel10.png",
      "name": "10",
      "cost": "13620",
      "levelBody": "Description: New Item! Pet Rabbit - aww what a cute widdle bunny wabbit!\nEffect: Allows the player to buy a Pet Rabbit. These pet rabbits can be placed within Geraldo's range. Buying 3 or less pet rabbits will not do anything other than being cosmetic at first. However, upon buying the 4th Pet Rabbit, will cause all rabbits to merge into an enraged Pet Rabbit with red eyes, and no more can be bought. This Pet Rabbit attacks relative to its current position, in an Area of effect swipe, rapidly hitting multiple bloons."
    },
    {
      "image": "herolevel11.png",
      "name": "11",
      "cost": "16380",
      "levelBody": "Description: New Item! Rejuv Potion - resets all Monkey Tower and Hero cooldowns, restores 50 lives. Geraldo's main attack pierce increases, and Jar of Pickles grants bonus damage vs. Fortified Bloons.\nEffect: Unlocks Rejuv Potion, which resets ability cooldowns of all towers and heroes on screen, and restores 50 lives.\n\n\nGeraldo now begins selling upgraded items from this level; upgrades do not apply to previously-purchased items. Jar of Pickles now grants +1 damage to Fortified. Geraldo's attack pierce increases from 10 to 20."
    },
    {
      "image": "herolevel12.png",
      "name": "12",
      "cost": "14400",
      "levelBody": "Description: New Item! Genie Bottle - summons a plasma-powered Genie Monkey that lasts for 2 rounds. Creepy Idol can now apply an occasional short stun to passive visible MOAB-class Bloons.\nEffect: Unlocks Genie Bottle. Placing a Genie Bottle on the map will cause a flying genie to fly a figure-8 pattern on the center of the map for 2 rounds, attacking nearby bloons with Plasma attacks.\n\n\nCreepy Idol now also affects MOAB-class Bloons (except B.A.D.s) but only stuns them with a 15% random chance instead of sending them back. MOABs are stunned for 3 seconds, BFBs for 2 seconds, and ZOMGs and DDTs for 1 second."
    },
    {
      "image": "herolevel13.png",
      "name": "13",
      "cost": "16650",
      "levelBody": "Description: Shooty Turret fires faster with increased damage, and Stack of Old Nails do more damage.\nEffect: Geraldo now sells improved Shooty Turrets and improved Stacks of Old Nails. Shooty Turret deals 7 damage instead of 2, and Stack of Old Nails deals 6 damage per spike instead of 1."
    },
    {
      "image": "herolevel14.png",
      "name": "14",
      "cost": "14940",
      "levelBody": "Description: See Invisibility Potion grants additional range and lasts longer.\nEffect: See Invisibility Potion also grants +20% range and lasts 5 more rounds."
    },
    {
      "image": "herolevel15.png",
      "name": "15",
      "cost": "16380",
      "levelBody": "Description: Sharpening Stone now increases damage in addition to pierce, and Blade Trap creates a more powerful effect when triggered.\nEffect: Upgrades Sharpening Stone and Blade Trap:\nNew Sharpening Stone adds +1 damage in addition to pierce\nBlades created from the new Blade Trap now act like a Super Maelstrom, dealing 2 damage and popping Frozen and Lead, but still only produces blades for 3 seconds."
    },
    {
      "image": "herolevel16.png",
      "name": "16",
      "cost": "17820",
      "levelBody": "Description: Stack of Old Nails becomes a Nail Mine, Jar of Pickles grants additional bonus damage vs. Fortified Bloons, and Gerry's Fire gains bonus burny damage.\nEffect: Upgrades the Stack of Old Nails, Gerry's Fire, and Jar of Pickles:\nStack of Old Nails become Nail Mines, gaining more spikes and exploding when they lose all their spikes, similar to Spiked Mines.\nJar of Pickles grants another +1 damage vs Fortified.\nGerry's Fire deals 3 damage via the burning damage-over-time instead of 1."
    },
    {
      "image": "herolevel17.png",
      "name": "17",
      "cost": "19260",
      "levelBody": "Description: Geraldo's main attack does more damage and Amaz-o-Glue now has a small effect on MOAB-class Bloons.\nEffect: Tube of Amaz-o-Glue can affect MOAB-class bloons. Blimps consume extra pierce.\nMOAB: 10 pierce\nBFB and DDT: 20 pierce\nZOMG: 50 pierce\n\nIn addition, Geraldo's main attack damage increased from 3 to 4."
    },
    {
      "image": "herolevel18.png",
      "name": "18",
      "cost": "20700",
      "levelBody": "Description: Genie gains a second close-target attack and does bonus damage to MOAB-class Bloons. When Creepy Idol expires, it covers nearby MOAB-Class Bloons in a Mystical Shroud, causing damage when popped.\nEffect: Geraldo's Genie Bottle and Creepy Idol are upgraded:\nGenie Bottle: When near Bloons, will fire a second stream of plasma that deals 40 damage instead of 20. Both plasma streams also deal an extra 10 damage to MOAB-class Bloons.\nCreepy Idol: When it's sold or expired, an effect similar to Unstable Concoction are applied to nearby MOAB-Class Bloons that causes an explosion when it is popped."
    },
    {
      "image": "herolevel19.png",
      "name": "19",
      "cost": "16470",
      "levelBody": "Description: Geraldo's main attack is greatly improved and See Invisibility Potion gains bonus damage to Camo Bloons.\nEffect: See Invisibility Potion now grants +1 damage to Camos on top of previous benefits. Geraldo attack cooldown reduced from 1s to 0.8s, gains +3 range, and pierce increased from 20 to 25."
    },
    {
      "image": "herolevel20.png",
      "name": "20",
      "cost": "17280",
      "levelBody": "Description: New Item! Paragon Power Totem - adds paragon power to the next paragon created. Shop restocks fully! Geraldo's main attack does more damage.\nEffect: Unlocks Paragon Power Totem in Geraldo's Shop. Placing totems increases the amount of power, which give higher degrees, for your next Paragon. The total additional power scales with how many totems are on screen. Each totem will merge into the next Paragon you upgrade, providing 2,000 power, and getting consumed.\n\n\nFully restocks all items upon reaching this level, and this particular full restock only works once per game.\n\nGeraldo's damage increased from 4 to 9."
    }
  ]
}