{
  "id": "beast_handler",
  "name": "Beast Handler",
  "image": "000_beasthandler.png",
  "type": "Support",
  "unlock": "Completion of 3 stages of \"Epic Beast Quest\" unlocked at Level 40",
  "inGameDesc": "Trains land, water, or air beasts. Multiple Beast Handlers can have their own beasts, or combine efforts to train a single beast with greater beast power.",
  "cost": {
    "easy": "210",
    "medium": "250",
    "hard": "270",
    "impoppable": "300"
  },
  "target": "First, Last,\nClose, Strong\n\nBeast targeting (Place Beast)\n\nMerge (when multiple Beast Handlers combine with their beasts to upgrade)",
  "stats": {
    "damage": "1",
    "pierce": "4",
    "attackSpeed": "1.4s",
    "range": "20 (itself range)\n60 (control beast range)",
    "statuseffects": "N/A",
    "towerboosts": "N/A",
    "incomeboosts": "N/A",
    "camo": "Yes (via Horned Owl or T Rex Stomp ability)",
    "footprint": "7",
    "damageType": " Energy"
  },
  "paths": {
    "path1": [
      {
        "image": "piranhaupgradeicon.png",
        "name": "Piranha",
        "cost": {
          "easy": "135",
          "medium": "160",
          "hard": "175",
          "impoppable": "190"
        },
        "unlock": "250 XP",
        "upgradeBody": "Description: Command a small but feisty little fish to leap from the water at the Bloons.\nEffect: Requires water terrain within tower range to be purchasable. Summons a Piranha that leaps at Bloons within range, has 1 base Beast Power and 1 max Beast Power, dealing 1 damage, and has 1 pierce and 25 range."
      },
      {
        "image": "barracudaupgradeicon.png",
        "name": "Barracuda",
        "cost": {
          "easy": "745",
          "medium": "875",
          "hard": "945",
          "impoppable": "1,050"
        },
        "unlock": "500 XP",
        "upgradeBody": "Description: The Barracuda slaps Bloons backwards and pops multiple layers with their razor sharp teeth.\nEffect: Transforms the Piranha into a Barracuda. Attack speed is improved and attacks push Bloons back slightly.\nBase Beast Power becomes 3, with 2 damage, 4 pierce, and 30 range (from 25). Max Beast Power becomes 6 with 4 damage and 10 pierce."
      },
      {
        "image": "greatwhiteupgradeicon.png",
        "name": "Great White",
        "cost": {
          "easy": "2,505",
          "medium": "2,950",
          "hard": "3,185",
          "impoppable": "3,540"
        },
        "unlock": "1,000 XP",
        "upgradeBody": "Description: The Great White will crush Bloons, including Lead Bloons in its jaws, dragging them back to the water if needed. At max Beast Power the Great White can drag down MOABs.\nEffect: Transforms the Barracuda into a Great White Shark. Great White latches onto any bloon target for upwards of 6 seconds, dragging it into the water if Ceramic or below. It thrashes its tail while doing so, repeatedly dealing splash damage. Attacks knock-back bloons and slow MOAB-Class, apart from BADs and bosses.\nBase Beast Power becomes 8, with 8 splash damage, 6 pierce, and 40 range (from 30). Max Beast Power becomes 24, with 24 damage, 24 pierce, and the capability to drag down MOABs."
      },
      {
        "image": "orcaupgradeicon.png",
        "name": "Orca",
        "cost": {
          "easy": "10,625",
          "medium": "12,500",
          "hard": "13,500",
          "impoppable": "15,000"
        },
        "unlock": "4,250 XP",
        "upgradeBody": "Description: The mighty Orca's huge mouth can grab and drag all but the very largest Bloons into the depths. At max Beast Power the Orca can drag down ZOMGs.\nEffect: Transforms the Great White into an Orca. The Orca can drag down MOABs and BFBs by default.\nBase Beast Power becomes 16, with 30 splash damage, 20 pierce, and 40 range. Max Beast Power becomes 64, with 90 damage, 60 pierce, and the capability to drag down ZOMGs (and DDTs if Camo Detection is provided)."
      },
      {
        "image": "megalodonupgradeicon.png",
        "name": "Megalodon",
        "cost": {
          "easy": "38,250",
          "medium": "45,000",
          "hard": "48,600",
          "impoppable": "54,000"
        },
        "unlock": "100,000 XP",
        "upgradeBody": "Description: A truly colossal shark with a taste for Bloon. Requires 3 additional Orca Handlers to control.\nEffect: 3 other Orca Handlers are required to be merged with this tower for the upgrade to be purchasable. Transforms the Orca into a Megalodon. Megalodon can drag down BADs, including Fortified, by default, before round 146.\nBase Beast Power becomes 84 (down to 36 if Orca Handlers are sold), with 550 splash damage, 62 pierce, and 60 range. Max Beast Power becomes 132, with 750 damage and 74 pierce."
      }
    ],
    "path2": [
      {
        "image": "microraptorupgradeicon.png",
        "name": "Microraptor",
        "cost": {
          "easy": "165",
          "medium": "195",
          "hard": "210",
          "impoppable": "235"
        },
        "unlock": "250 XP",
        "upgradeBody": "Description: Command a sharp clawed little dinosaur.\nEffect: Summon a Microraptor that attacks with its claws, has 1 base Beast Power and 1 max Beast Power, 20 range, deals 1 damage, attacks every 1.0s, and has 5 pierce."
      },
      {
        "image": "adasaurusupgradeicon.png",
        "name": "Adasaurus",
        "cost": {
          "easy": "805",
          "medium": "945",
          "hard": "1,020",
          "impoppable": "1,135"
        },
        "unlock": "500 XP",
        "upgradeBody": "Description: The sharp teeth of Adasaurus deal high short range damage that can tear through Lead.\nEffect: Transforms the Microraptor into an Adasaurus. Adasaurus can pop Frozen and Lead Bloons, and changes appearance at max Beast Power.\nBase Beast Power becomes 3 with 3 damage, 8 pierce, and 1.0s attack speed. Max Beast Power becomes 6, with 6 damage, 20 pierce, and 0.59s attack speed."
      },
      {
        "image": "velociraptorupgradeicon.png",
        "name": "Velociraptor",
        "cost": {
          "easy": "2,210",
          "medium": "2,600",
          "hard": "2,810",
          "impoppable": "3,120"
        },
        "unlock": "1,000 XP",
        "upgradeBody": "Description: Velociraptor viciously slashes and chomps, dealing more damage to stunned Bloons.\nEffect: Transforms the Adasaurus into a Velociraptor. Velociraptor deals more damage to stunned Bloons and changes appearance twice at Beast Power 16 and 24.\nBase Beast Power becomes 8, with 9 damage, 14 pierce, 1.0s attack speed and 24 range. Max Beast Power becomes 24, with 27 damage, 36 pierce and 0.59s attack speed."
      },
      {
        "image": "tyrannosaurusrexupgradeicon.png",
        "name": "Tyrannosaurus Rex",
        "cost": {
          "easy": "8,075",
          "medium": "9,500",
          "hard": "10,260",
          "impoppable": "11,400"
        },
        "unlock": "5,000 XP",
        "upgradeBody": "Description: The Tyrannosaurus Rex's huge jaw and sharp teeth deal a ton of damage with each bite. T Rex Stomp ability: Stuns up to ZOMG Bloons in a wide area.\nEffect: Transforms the Velociraptor into a Tyrannosaurus Rex. Changes appearance twice at Beast Power 36 and 64. Gains Stomp ability which stuns up to 400 bloons within range, including ZOMGs and DDTs, for 6 seconds, dealing 150 damage, and has a 35s cooldown. At max Beast Power, ability deals 214 damage, stuns up to 436 bloons, reduces cooldown to 17.5s, and damage and stun carry over from MOAB-class to their children.\nBase Beast Power becomes 16, with 32 damage, 8 bonus damage to stunned bloons, 24 pierce, and 30 range. Max Beast Power becomes 64, with 96 damage, 29 bonus damage to stunned bloons, 60 pierce, and damage carries over from MOAB-class to their children."
      },
      {
        "image": "giganotosaurusupgradeicon.png",
        "name": "Giganotosaurus",
        "cost": {
          "easy": "59,500",
          "medium": "70,000",
          "hard": "75,600",
          "impoppable": "84,000"
        },
        "unlock": "90,000 XP",
        "upgradeBody": "Description: The biggest and most fierce dinosaur of them all, Giganotosaurus can shred almost any Bloon instantly and with ease. Stomp ability hits the whole map and lasts longer. Requires 3 additional Tyrannosaurus Handlers to control.\nEffect: 3 other Tyrannosaurus Handlers are required to be merged with this tower for the upgrade to be purchasable. Transforms the T-Rex into a Giganotosaurus. Stomp ability now hits entire map, deals 550 damage and stuns up to 645 bloons for 12 seconds (6s for MOABs, 4s for BFBs, and 3s for ZOMGs and DDTs), and has a 25s cooldown. At max Beast Power, ability deals 950 damage, pierce is 645, and cooldown is 17.5s. Changes appearances twice at Beast Power 100 and 132.\nBase Beast Power becomes 84 (down to 36 if Tyrannosaurus Handlers are sold), with 1150 damage, 1533 damage against stunned bloons, 105 pierce, 1.25s attack speed, and 50 range. Max Beast Power becomes 132, with 1550 damage, 2066 damage against stunned bloons, 150 pierce, and damage carries over from MOAB-class to their children."
      }
    ],
    "path3": [
      {
        "image": "gyrfalconupgradeicon.png",
        "name": "Gyrfalcon",
        "cost": {
          "easy": "155",
          "medium": "180",
          "hard": "195",
          "impoppable": "215"
        },
        "unlock": "250 XP",
        "upgradeBody": "Description: Command a noble little bird of prey that can grab and move Bloons to the drop-off target. Bloons up-track of the target get scratched.\nEffect: Requires track within tower range to be purchasable. Summons a gyrfalcon, which does 1 damage and carries up to 3 Bloons partway towards the entrance with its claws. Cannot carry Lead, Ceramic, or MOAB class Bloons. Has 1 base Beast Power and 1 max Beast Power. Deals +1 Regrow damage."
      },
      {
        "image": "hornedowlupgradeicon.png",
        "name": "Horned Owl",
        "cost": {
          "easy": "780",
          "medium": "915",
          "hard": "990",
          "impoppable": "1,100"
        },
        "unlock": "500 XP",
        "upgradeBody": "Description: The Horned Owl is strong enough to grab Ceramic Bloons, and has keen eyes that can detect Camo Bloons.\nEffect: Transforms the Gyrfalcon into a Horned Owl. Can detect camo and pick up more bloons. Can pick up Leads (if given Lead-popping) equal to pierce minus one; Fortified Leads consume 2 pierce each and Ceramics consume 6.\nBase Beast Power becomes 3, with 1 damage, 8 pierce and 0.7s attack speed. Max Beast Power becomes 6, with 2 damage and 16 pierce."
      },
      {
        "image": "goldeneagleupgradeicon.png",
        "name": "Golden Eagle",
        "cost": {
          "easy": "2,550",
          "medium": "3,000",
          "hard": "3,240",
          "impoppable": "3,600"
        },
        "unlock": "1,000 XP",
        "upgradeBody": "Description: The Golden Eagle's huge talons make it an expert at grabbing large numbers of Bloons at once.\nEffect: Transforms the Horned Owl into a Golden Eagle. Lead (if given Lead-popping) consumes only 1 pierce (from 2) and Ceramic consumes 2 (from 6).\nBase Beast power becomes 8, with 2 damage and 15 pierce. Max Beast power becomes 24, with 6 damage, 45 pierce, and the capability to pick up MOABs, which consume 15 pierce."
      },
      {
        "image": "giantcondorupgradeicon.png",
        "name": "Giant Condor",
        "cost": {
          "easy": "6,800",
          "medium": "8,000",
          "hard": "8,640",
          "impoppable": "9,600"
        },
        "unlock": "5,500 XP",
        "upgradeBody": "Description: The huge talons of the fearsome Giant Condor can pick up smaller MOAB-Class Bloons.\nEffect: Transforms the Golden Eagle into a Giant Condor. Ceramics consume 2 pierce, and MOABs consume 10 (from 15). Can pick up to BFBs, which consume 30 pierce. If made able to pop Lead, Condors can grab DDTs, which consume 50 pierce.\nBase Beast power becomes 16, with 2 damage, 13 MOAB-class damage, and 30 pierce. Max Beast Power becomes 64, with 6 damage, 23 MOAB-class damage, and 90 pierce."
      },
      {
        "image": "pouākaiupgradeicon.png",
        "name": "Pouākai",
        "cost": {
          "easy": "25,500",
          "medium": "30,000",
          "hard": "32,400",
          "impoppable": "36,000"
        },
        "unlock": "110,000 XP",
        "upgradeBody": "Description: The legendary Pouākai, a bird so large that it can pick up, carry off and destroy almost any number of Bloons of almost any size. Requires 3 additional Condor Handlers to control.\nEffect: 3 other Condor Handlers are required to be merged with this tower for the upgrade to be purchasable. Transforms the Giant Condor into a Pouākai. Can naturally pop Lead and pick up ZOMGs, which consume 50 pierce. DDTs now consume 30 pierce (from 50), and Ceramics consume only 1 (from 2). BADs and bosses can be hit but not picked up.\nBase Beast Power becomes 84 (down to 36 if Giant Condor Handlers are sold), with 40 damage, 150 MOAB-class damage, and 325 pierce. Max Beast Power becomes 132, with 60 damage, 230 MOAB-class damage, and 450 pierce."
      }
    ]
  }
}