{
  "id": "engineer_monkey",
  "name": "Engineer Monkey",
  "image": "000_engineermonkey.png",
  "type": "Support",
  "unlock": "Level 22-24 and Level 26",
  "inGameDesc": "Holds a trusty nail-gun to pop the Bloons. Can upgrade to create its own nail-shooting sentry turrets.",
  "cost": {
    "easy": "340",
    "medium": "400",
    "hard": "430",
    "impoppable": "480"
  },
  "target": "First, Last, Close, Strong,\nManual Targeting with Cleansing Foam or 0-1-4 Bloon Trap",
  "stats": {
    "damage": "1",
    "pierce": "3",
    "attackSpeed": "0.7s",
    "range": "40",
    "statuseffects": "Requires upgrades",
    "towerboosts": "Requires upgrades",
    "incomeboosts": "Requires upgrades",
    "camo": "Yes (x-3-x, only decamo via foam)",
    "footprint": "Medium (7)",
    "damageType": " Sharp"
  },
  "paths": {
    "path1": [
      {
        "image": "sentrygunupgradeicon.png",
        "name": "Sentry Gun",
        "cost": {
          "easy": "425",
          "medium": "500",
          "hard": "540",
          "impoppable": "600"
        },
        "unlock": "160 XP",
        "upgradeBody": "Description: Creates temporary sentry guns and deploys them nearby.\nEffect: Produces temporary sentry guns onto nearby land. Sentry Guns pop up to 2 bloons per shot, lasts for up to 25 seconds before disappearing, and can be improved with crosspathing."
      },
      {
        "image": "fasterengineeringupgradeicon.png",
        "name": "Faster Engineering",
        "cost": {
          "easy": "340",
          "medium": "400",
          "hard": "430",
          "impoppable": "480"
        },
        "unlock": "550 XP",
        "upgradeBody": "Description: Increased efficiency allows the Engineer to produce sentries, foam and bloon traps more often.\nEffect: Produces all contraptions +66% faster (0.60x attack cooldown)."
      },
      {
        "image": "sprocketsupgradeicon.png",
        "name": "Sprockets",
        "cost": {
          "easy": "490",
          "medium": "575",
          "hard": "620",
          "impoppable": "690"
        },
        "unlock": "1,850 XP",
        "upgradeBody": "Description: Increases sentry gun and Engineer attack speed.\nEffect: Nailgun and newly deployed sentry guns attack twice as fast."
      },
      {
        "image": "sentryexpertupgradeicon.png",
        "name": "Sentry Expert",
        "cost": {
          "easy": "2,125",
          "medium": "2,500",
          "hard": "2,700",
          "impoppable": "3,000"
        },
        "unlock": "9,500 XP",
        "upgradeBody": "Description: Sentries deploy with different damage types based on your need.\nEffect: Replaces all new sentries with four specialized sentries: Crushing, Boom, Cold, and Energy. Adjusts deployment of these four sentry types depending on bloons on the screen."
      },
      {
        "image": "sentryparagonupgradeicon.png",
        "name": "Sentry Champion",
        "cost": {
          "easy": "27,200",
          "medium": "32,000",
          "hard": "34,560",
          "impoppable": "38,400"
        },
        "unlock": "30,000 XP",
        "upgradeBody": "Description: Creates super-powerful but highly unstable sentries.\nEffect: Replaces all new sentries with powerful plasma sentries that shoot plasma 15 times per second that have 5 pierce and 2 damage. The sentries can pop Frozen and Lead but cannot pop Camo or Purple. Expired sentries now explode a wave of plasma after 25 seconds or when sold, instead of disappearing."
      }
    ],
    "path2": [
      {
        "image": "largerserviceareaupgradeicon.png",
        "name": "Larger Service Area",
        "cost": {
          "easy": "215",
          "medium": "250",
          "hard": "270",
          "impoppable": "300"
        },
        "unlock": "170 XP",
        "upgradeBody": "Description: Shoots further and deploys sentries in a much larger area. Sentries have longer range\nEffect: Engineer gains +20 range and any newly deployed sentries gain +4 range. Allow newly placed selectable placement for Bloon Traps."
      },
      {
        "image": "deconstructionupgradeicon.png",
        "name": "Deconstruction",
        "cost": {
          "easy": "295",
          "medium": "350",
          "hard": "380",
          "impoppable": "420"
        },
        "unlock": "500 XP",
        "upgradeBody": "Description: Nail gun and Sentry shots do extra damage to MOAB-class and Fortified Bloons.\nEffect: Nailgun and newly deployed sentries deal +1 damage to MOAB-class and +1 damage to Fortified."
      },
      {
        "image": "cleansingfoamupgradeicon.png",
        "name": "Cleansing Foam",
        "cost": {
          "easy": "720",
          "medium": "850",
          "hard": "920",
          "impoppable": "1,020"
        },
        "unlock": "2,000 XP",
        "upgradeBody": "Description: Sprays foam that removes Camo and Regrow and pops Lead Bloons.\nEffect: Sprays foam anywhere on nearby bloon track. Bloons that hit the foam will permanently lose Camo and Regrow properties. Deals 1 damage to any passing Lead Bloons. If crosspathed with Sentry Gun, sentries shoot foamy nails that apply foam effect on hitted bloons. If crosspathed with Pin, foam slows every non-blimp bloon by 50%. In addition, attacks 4x faster for the first 1 seconds of a round."
      },
      {
        "image": "overclockupgradeicon.png",
        "name": "Overclock",
        "cost": {
          "easy": "11,475",
          "medium": "13,500",
          "hard": "14,580",
          "impoppable": "16,200"
        },
        "unlock": "14,000 XP",
        "upgradeBody": "Description: Overclock Ability: Target another tower to supercharge its attack speed for a short time.\nEffect: Ability temporarily increases attack speed of tower, range of a Monkey Village, or production of a Banana Farm. Ability duration depends on tier of the selected tower. Main attack gains more pierce."
      },
      {
        "image": "ultraboostupgradeicon.png",
        "name": "Ultraboost",
        "cost": {
          "easy": "61,200",
          "medium": "72,000",
          "hard": "77,760",
          "impoppable": "86,400"
        },
        "unlock": "35,000 XP",
        "upgradeBody": "Description: Ultra-Overclocked Monkeys gain a small but permanent boost every time they are overclocked.\nEffect: Ability now permanently applies a 10th of the bonus of Overclock onto the selected tower, stacking up to 10 times. Ability cooldown reduced to 35 seconds. Main attack gains even more pierce."
      }
    ],
    "path3": [
      {
        "image": "oversizenailsupgradeicon.png",
        "name": "Oversize Nails",
        "cost": {
          "easy": "380",
          "medium": "450",
          "hard": "485",
          "impoppable": "540"
        },
        "unlock": "150 XP",
        "upgradeBody": "Description: Massivization allows nails to pop 8 Bloons at once, including frozen. Also increases Foam and Sentry effectiveness.\nEffect: Nailgun pierce increases from 3 to 8. Pierce of regular sentries increased from 2 to 3 and foam increased from 10 to 15."
      },
      {
        "image": "pinupgradeicon.png",
        "name": "Pin",
        "cost": {
          "easy": "185",
          "medium": "220",
          "hard": "235",
          "impoppable": "265"
        },
        "unlock": "500 XP",
        "upgradeBody": "Description: Pins Bloons in place for a short time when struck.\nEffect: Nailgun nails pin any non-blimp bloon other than Leads and Ceramics. Can give Pin effect to sentries with Sprockets or above. Also lets Cleansing Foam slow down any non-blimp bloons."
      },
      {
        "image": "doublegunupgradeicon.png",
        "name": "Double Gun",
        "cost": {
          "easy": "425",
          "medium": "500",
          "hard": "540",
          "impoppable": "600"
        },
        "unlock": "1,800 XP",
        "upgradeBody": "Description: Two guns for twice the fun.\nEffect: Double nailgun attack speed."
      },
      {
        "image": "bloontrapupgradeicon.png",
        "name": "Bloon Trap",
        "cost": {
          "easy": "2,975",
          "medium": "3,500",
          "hard": "3,780",
          "impoppable": "4,200"
        },
        "unlock": "11,000 XP",
        "upgradeBody": "Description: Bloon trap captures Bloons until full. Select to empty full trap for cash.\nEffect: Produces a Bloon Trap that captures up to 500 RBE worth of non-blimp bloons. Manually collecting the full trap earns a bonus +100% income compared to popping them normally. Bloon Traps can only trap bloons it can target. Middle path crosspath allows traps to be manually adjusted, autocollecting them."
      },
      {
        "image": "xxxltrapupgradeicon.png",
        "name": "XXXL Trap",
        "cost": {
          "easy": "40,800",
          "medium": "48,000",
          "hard": "51,840",
          "impoppable": "57,600"
        },
        "unlock": "40,000 XP",
        "upgradeBody": "Description: Huge Bloon traps can trap some of the largest Bloons in them...\nEffect: Produces a huge XXXL Bloon Trap that captures up to 10,000 RBE worth of all bloon excluding BADs, Bosses, and undetected Camo. There is a 2 second cooldown between each trap that starts when placed. Manually collecting the full trap earns a bonus +100% compared to popping them normally. Only one XXXL trap can be on screen at any time per player."
      }
    ],
    "paragon": {
      "image": "masterbuilderupgradeicon.png",
      "name": "Master Builder",
      "cost": {
        "easy": "552,500",
        "medium": "650,000",
        "hard": "702,000",
        "impoppable": "780,000"
      },
      "unlock": "750,000 XP",
      "upgradeBody": "Description: Monkey engineering developed to perfection. Creates three Mega Sentries that can build their own sentries.\nEffect: Upgrades into a four-armed supersonic nail-shooting machine that produces three permanent specialized Mega Sentries (Green, Red, Blue) that themselves produce their own temporary miniature Modified Paragon Sentries (stronger versions of Champion Sentries). Nails deal enormous damage and can stun MOAB-class bloons. Can manually place Mega Sentries on any land location. Also overclocks itself at the start of each round."
    }
  }
}