{
  "id": "wizard_monkey",
  "name": "Wizard Monkey",
  "image": "000_wizardmonkey.png",
  "type": "Magic",
  "unlock": "Level 15-17 and Level 19-20",
  "inGameDesc": "Hurls magical bolts of energy at the Bloons. Can upgrade to a variety of powerful spells.",
  "cost": {
    "easy": "320",
    "medium": "375",
    "hard": "405",
    "impoppable": "450"
  },
  "target": "First, Last, Close, Strong,\nCamo Priority with Monkey Sense\n\nIf purchased, Wall of Fire will default to Close. With Guided Magic, Wall of Fire obeys set Target Priority.",
  "stats": {
    "damage": "1",
    "pierce": "3",
    "attackSpeed": "1.1s",
    "range": "40",
    "statuseffects": "N/A",
    "towerboosts": "N/A",
    "incomeboosts": "N/A",
    "camo": "Yes (x-x-2)",
    "footprint": "Medium (7)",
    "damageType": " Energy"
  },
  "paths": {
    "path1": [
      {
        "image": "guildedmagicupgradeicon.png",
        "name": "Guided Magic",
        "cost": {
          "easy": "125",
          "medium": "150",
          "hard": "160",
          "impoppable": "180"
        },
        "unlock": "110 XP",
        "upgradeBody": "Description: Magic shots seek out the Bloons, even behind cover.\nEffect: All magical bolts can ignore Line of Sight and can seek at bloons. Most other attacks also ignore Line of Sight and gain further projectile lifespan. Phoenixes with Guided Magic can lightly home."
      },
      {
        "image": "arcaneblastupgradeicon.png",
        "name": "Arcane Blast",
        "cost": {
          "easy": "380",
          "medium": "450",
          "hard": "485",
          "impoppable": "540"
        },
        "unlock": "600 XP",
        "upgradeBody": "Description: Bigger more powerful magic blasts pop through 2 layers of Bloon.\nEffect: Main bolt's projectile size increased and now deals 2 damage."
      },
      {
        "image": "arcanemasteryupgradeicon.png",
        "name": "Arcane Mastery",
        "cost": {
          "easy": "1,105",
          "medium": "1,300",
          "hard": "1,405",
          "impoppable": "1,560"
        },
        "unlock": "2,300 XP",
        "upgradeBody": "Description: Faster attacks with increased range, damage, and popping power.\nEffect: Gains +20 range, 2x attack speed, deals 3 damage per bolt instead of 2, and pops +4 bloons."
      },
      {
        "image": "arcanespikeupgradeicon.png",
        "name": "Arcane Spike",
        "cost": {
          "easy": "8,500",
          "medium": "10,000",
          "hard": "10,800",
          "impoppable": "12,000"
        },
        "unlock": "11,000 XP",
        "upgradeBody": "Description: Faster firing magic does huge damage to most Bloon types.\nEffect: Deals 6 damage per shot and 16 versus MOAB-class. Attacks 4x faster than an unupgraded Wizard and can pop Lead Bloons."
      },
      {
        "image": "archmageupgradeicon.png",
        "name": "Archmage",
        "cost": {
          "easy": "27,200",
          "medium": "32,000",
          "hard": "34,560",
          "impoppable": "38,400"
        },
        "unlock": "35,000 XP",
        "upgradeBody": "Description: A true master of magical wizardry. Attack faster and does more damage to MOAB-Class Bloons.\nEffect: Even higher damage bolts deal 7 damage and 26 MOAB-class damage and attack twice as fast as Arcane Spike. Additionally gains Dragon's Breath and Shimmer attacks, and all additionally attacks also gain twice as fast speed and deal double damage to MOAB-Class Bloons (including crosspathing path 2 Fireball and Wall of Fire)."
      }
    ],
    "path2": [
      {
        "image": "fireballupgradeicon.png",
        "name": "Fireball",
        "cost": {
          "easy": "255",
          "medium": "300",
          "hard": "325",
          "impoppable": "360"
        },
        "unlock": "130 XP",
        "upgradeBody": "Description: Every few seconds casts an explosive fireball spell.\nEffect: Every 2.2s, produces a fireball that explodes on impact. Fireballs cannot explode if collided onto Purple Bloons, and fireball explosions cannot damage Black properties."
      },
      {
        "image": "walloffireupgradeicon.png",
        "name": "Wall of Fire",
        "cost": {
          "easy": "680",
          "medium": "800",
          "hard": "865",
          "impoppable": "960"
        },
        "unlock": "700 XP",
        "upgradeBody": "Description: Creates a super hot wall of fire across the track to roast the Bloons as they pass.\nEffect: Creates a blaze of fire onto the closest region of bloon track. The blaze will regularly damage bloons as they pass through. Crosspathing with Guided Magic allows Wall of Fire placement to be manually adjusted, and also lasting 6.5 instead of 4.5s making 100% uptime."
      },
      {
        "image": "dragonsbreathupgradeicon.png",
        "name": "Dragon's Breath",
        "cost": {
          "easy": "2,805",
          "medium": "3,300",
          "hard": "3,565",
          "impoppable": "3,960"
        },
        "unlock": "2,600 XP",
        "upgradeBody": "Description: Spews endless flames at nearby Bloons and enhances Fireball and Wall of Fire.\nEffect: Rapidly spews flames at bloons. Flames deal 2 damage and sets affected bloons on fire for more damage. Fireball deals 9 damage and 14 blast radius, Wall of Fire spawns every 4.5s and gains +10 pierce, and increases tick rate of Wall of Fire."
      },
      {
        "image": "summonphoenixupgradeicon.png",
        "name": "Summon Phoenix",
        "cost": {
          "easy": "6,375",
          "medium": "7,500",
          "hard": "8,100",
          "impoppable": "9,000"
        },
        "unlock": "13,000 XP",
        "upgradeBody": "Description: Summon Phoenix ability: Powerful phoenix wreaks Bloon havoc for 20 seconds.\nEffect: Ability generates a phoenix that rapidly spews flames which deal 5 damage each. Phoenix has infinite range, ignores line of sight, and has a 45 second cooldown. Phoenix flames lightly home with 1-4-0 crosspath."
      },
      {
        "image": "wizardlordphoenixupgradeicon.png",
        "name": "Wizard Lord Phoenix",
        "cost": {
          "easy": "42,500",
          "medium": "50,000",
          "hard": "54,000",
          "impoppable": "60,000"
        },
        "unlock": "35,000 XP",
        "upgradeBody": "Description: Wizard Lord becomes a master of the flame, turning into a super powerful Lava Phoenix for a short time.\nEffect: Enhances damage of all fire-related attacks, Dragon's Breath attack gains 46 pierce and damage increased from 2 to 6. Wall of Fire damage increased from 1 to 3 and fireball damage is tripled. Phoenix is now permanent. Ability now transforms the monkey into a super-phoenix that spews even stronger flames and regular volleys of powerful meteors."
      }
    ],
    "path3": [
      {
        "image": "intensemagicupgradeicon.png",
        "name": "Intense Magic",
        "cost": {
          "easy": "255",
          "medium": "300",
          "hard": "325",
          "impoppable": "360"
        },
        "unlock": "140 XP",
        "upgradeBody": "Description: More powerful magic shots move faster and can pop more Bloons.\nEffect: Bolt gains +5 pierce and moves faster. Most fire-based attacks gain a certain amount of bonus pierce."
      },
      {
        "image": "monkeysenseupgradeicon.png",
        "name": "Monkey Sense",
        "cost": {
          "easy": "255",
          "medium": "300",
          "hard": "325",
          "impoppable": "360"
        },
        "unlock": "500 XP",
        "upgradeBody": "Description: Increase range slightly and allows the Wizard to hit Camo Bloons.\nEffect: Wizard gains +10 range, camo detection and can access Camo Prioritization."
      },
      {
        "image": "shimmerupgradeicon.png",
        "name": "Shimmer",
        "cost": {
          "easy": "1,275",
          "medium": "1,500",
          "hard": "1,620",
          "impoppable": "1,800"
        },
        "unlock": "2,200 XP",
        "upgradeBody": "Description: Gains a dark magic attack that periodically reveals location of all nearby Camo bloons permanently.\nEffect: Gains a shimmer attack. If bloons get within range, the Wizard periodically produces dark waves of magic that permanently remove camo properties off bloons. Also gains +10 range."
      },
      {
        "image": "necromancerunpoppedarmyupgradeicon.png",
        "name": "Necromancer: Unpopped Army",
        "cost": {
          "easy": "2,380",
          "medium": "2,800",
          "hard": "3,025",
          "impoppable": "3,360"
        },
        "unlock": "10,000 XP",
        "upgradeBody": "Description: Reanimate recently popped enemies as servants to destroy the Bloons.\nEffect: Stores Undead Bloons into its personal graveyard every time any tower pops bloons within its range, and spawns them out to attack bloons. Undead Bloons pop any bloon type. Undead Bloons gain further pierce, damage, and attack speed as the graveyard count grows. All the Wizard's other attacks also gain up to +2 damage as the graveyard grows."
      },
      {
        "image": "soulbindupgradeicon.png",
        "name": "Prince of Darkness",
        "cost": {
          "easy": "22,525",
          "medium": "26,500",
          "hard": "28,620",
          "impoppable": "31,800"
        },
        "unlock": "30,000 XP",
        "upgradeBody": "Description: Reanimate even more powerful Bloon servants to obliterate the enemy and enhances all other Necromancers.\nEffect: Expands its personal graveyard greatly, Undead Bloons last longer, and can now also summon Undead MOABs and Undead BFBs that deal even more damage and pop more bloons. Improves damage and lifespan of all Undead Bloons on screen including its own. The Wizard's other attacks can now gain up to +10 damage with a full graveyard. Also gains a massive range of 80."
      }
    ],
    "paragon": {
      "image": "magusperfectusupgradeicon.png",
      "name": "Magus Perfectus",
      "cost": {
        "easy": "637,500",
        "medium": "750,000",
        "hard": "810,000",
        "impoppable": "900,000"
      },
      "unlock": "500,000 XP",
      "upgradeBody": "Description: Only the most perfect Wizard can channel the ancient powers of the beyond.\nEffect: Gains a powerful arsenal of magical spells with two powerful abilities and a permanent Dark Lord Phoenix that flies around the Magus Perfectus. Gains graveyard mana as it pops and damages Bloons but gradually depletes upon reaching the full 100k capacity. The Magus Perfectus initially shoots Arcane bolts which drain mana, which can be toggled into a mana-restoring focused beam instead which also disables the Dark Phoenix.\nPhoenix Explosion Ability: Sacrifices the Dark Lord Phoenix to unleash an invigorating burst of dark exothermic energy. Immediately incinerates the Bloons within blast of the Phoenix, and releases its graveyard into multiple Undead ZOMGs that consume 9000 graveyard mana each.\nArcane Metamorphosis Ability: Transforms into an alternate form that spews dark fiery breath onto Bloons and scatters blazes onto the Bloons. Duration depends on quantity of graveyard mana."
    }
  }
}