{
  "id": "vortex",
  "name": "Vortex Deadly Master of Air",
  "description": "Vortex moves like lightning and speeds other Bloons along!\n\nWhen each health bar skull is reached, Vortex shields himself and sends out a shockwave that stuns nearby Towers before retreating up the track.\nVortex emits a regular storm pulse, destroying projectiles, including non-Powers on the track.",
  "images": {
    "normal": "vortexportrait.png",
    "defeated": "vortexportraitdefeat.png",
    "elite": "vortexportraitelite.png",
    "eliteDefeated": "vortexportraitelitedefeat.png"
  },
  "health": {
    "normal": [
      {
        "tier": "1",
        "normal": "20,000",
        "coop2": "24,000",
        "coop3": "28,000",
        "coop4": "32,000"
      },
      {
        "tier": "2",
        "normal": "62,800",
        "coop2": "75,600",
        "coop3": "87,920",
        "coop4": "100,480"
      },
      {
        "tier": "3",
        "normal": "294,000",
        "coop2": "352,800",
        "coop3": "411,600",
        "coop4": "470,400"
      },
      {
        "tier": "4",
        "normal": "628,000",
        "coop2": "753,600",
        "coop3": "879,200",
        "coop4": "1,004,800"
      },
      {
        "tier": "5",
        "normal": "2,512,500",
        "coop2": "3,015,000",
        "coop3": "3,517,500",
        "coop4": "4,020,000"
      }
    ],
    "elite": [
      {
        "tier": "1",
        "normal": "41,800",
        "coop2": "50,160",
        "coop3": "58,520",
        "coop4": "66,880"
      },
      {
        "tier": "2",
        "normal": "251,000",
        "coop2": "301,200",
        "coop3": "351,400",
        "coop4": "401,600"
      },
      {
        "tier": "3",
        "normal": "1,675,000",
        "coop2": "2,010,000",
        "coop3": "2,345,000",
        "coop4": "2,680,000"
      },
      {
        "tier": "4",
        "normal": "6,700,000",
        "coop2": "8,040,000",
        "coop3": "9,380,000",
        "coop4": "10,720,000"
      },
      {
        "tier": "5",
        "normal": "33,500,000",
        "coop2": "40,200,000",
        "coop3": "46,900,000",
        "coop4": "53,600,000"
      }
    ]
  },
  "skullCount": {
    "normal": "3",
    "elite": "7"
  },
  "generalImmunities": [
    "The same immunities as the BAD (Stuns, Slowness, Knockback & Instapops).",
    "Immune to all forms of percentage-based damage and instant health reduction (i.e. MOAB Hex, Big Bloon Sabotage, and Grand Saboteur ability).",
    "Immune to Legend of the Night's passive black hole ability, meaning that leaking the boss will always result in a game over.",
    "Immune to Navarch of the Seas hook ability.",
    "Immune to Megalodon devour attack."
  ],
  "individualImmunities": [],
  "gimmicks": {
    "normal": [
      "When Vortex is activate it's accelerates Bloons by 150% (2.5x speed), affecting all naturally spawned Bloons.",
      "The speed boost disappears when Bloons reach Vortex's current position, except for natural Bloons on different lanes.",
      "If Vortex is defeated during a round, all remaining Bloons continue to have the speed buff until their they reach Vortex defeated position.",
      "Vortex releases a wind burst every 5 seconds and when reaching skull health, clearing projectiles and hazards within a radius of 60.",
      "Projectiles like bananas from Banana Farm are also removed, but Powers and Hero projectiles remain unaffected. Sticky attacks and explosive spikes still deal damage.",
      "When reaching skull health, Vortex is knocked back and stuns all towers within a radius of 60 (+5 with each tier), affecting their abilities and attacks for a short time.",
      "Stunned towers cannot generate income, attack, use abilities, and may lose passive abilities with an active component. Paragons can be stunned as well.",
      "Vortex generates a storm shield when reaching skull thresholds, deflecting most projectiles for 6 seconds, except those with high velocity or originating from inside the shield.",
      "The shield has a radius of 80 units.",
      "Vortex occasionally modifies or spawns faster Bloons during Custom Rounds and all natural Bloons have a +10% faster than normal speed."
    ],
    "elite": []
  }
}